Autodesk.Revit.DB.ScheduleFieldType
The type of data displayed in a schedule field.
Since:
2013
Since:
2013

Autodesk.Revit.DB.ScheduleFieldType.CombinedParameter
Combine parameters of the types that display in a specific part of a
schedule. The values for the combined parameters will display in the
same cell separated by a slash or other separator. You can add a prefix,
suffix or sample value to the parameter.

Autodesk.Revit.DB.ScheduleFieldType.PhysicalInstance
An instance parameter of the physical element of a scheduled analytical element.

Autodesk.Revit.DB.ScheduleFieldType.PhysicalType
A type parameter of the physical element of a scheduled analytical element.

Autodesk.Revit.DB.ScheduleFieldType.Analytical
A parameter of the analytical element of a scheduled physical element.

Autodesk.Revit.DB.ScheduleFieldType.Space
A parameter of the space that a scheduled element belongs to.

Autodesk.Revit.DB.ScheduleFieldType.StructuralMaterial
A parameter of the structural material of a scheduled element.

Autodesk.Revit.DB.ScheduleFieldType.RevitLinkType
A parameter of the RevitLinkType that an element in a linked
file belongs to.  Currently RVT_LINK_FILE_NAME_WITHOUT_EXT is the only
supported parameter.  Only allowed in schedules that include
elements from linked files.

Autodesk.Revit.DB.ScheduleFieldType.RevitLinkInstance
A parameter of the RevitLinkInstance that an element in a linked
file belongs to.  Currently RVT_LINK_INSTANCE_NAME is the only
supported parameter.  Only allowed in schedules that include
elements from linked files.

Autodesk.Revit.DB.ScheduleFieldType.MaterialQuantity
In a material takeoff, a value representing how a particular material
is used within a scheduled element.  The parameter ID can be
MATERIAL_AREA, MATERIAL_VOLUME, or MATERIAL_ASPAINT.

Autodesk.Revit.DB.ScheduleFieldType.Material
In a material takeoff, a parameter of one of the materials of a
scheduled element.

Autodesk.Revit.DB.ScheduleFieldType.ProjectInfo
A parameter of the Project Info element in the project that the
scheduled element belongs to, which may be a linked file.  Only
allowed in schedules that include elements from linked files.

Autodesk.Revit.DB.ScheduleFieldType.ToRoom
A parameter of the room on the "to" side of a door or window.

Autodesk.Revit.DB.ScheduleFieldType.FromRoom
A parameter of the room on the "from" side of a door or window.

Autodesk.Revit.DB.ScheduleFieldType.Room
A parameter of the room that a scheduled element belongs to.

Autodesk.Revit.DB.ScheduleFieldType.Percentage
A value indicating what percent of the total of another field each
element represents.

Autodesk.Revit.DB.ScheduleFieldType.Formula
A formula calculated from the values of other fields in the schedule.

Autodesk.Revit.DB.ScheduleFieldType.ViewBased
A specialized type of field used for a few parameters whose
displayed values can change based on the settings of the view:
ROOM_AREA and ROOM_PERIMETER in room and space schedules.
PROJECT_REVISION_REVISION_NUM in revision schedules.
KEYNOTE_NUMBER in keynote legends that are numbered by sheet.

Autodesk.Revit.DB.ScheduleFieldType.Count
The number of elements appearing on the schedule row.

Autodesk.Revit.DB.ScheduleFieldType.ElementType
A type parameter of the scheduled elements.

Autodesk.Revit.DB.ScheduleFieldType.Instance
An instance parameter of the scheduled elements.  All shared parameters
also use this type, regardless of whether they are instance or type
parameters.